---
kind: property
id: P:Autodesk.Revit.DB.Material.Smoothness
zh: 材质、材料
source: html/6486d2bb-727e-d62c-b278-4c5ece4d5e7d.htm
---
# Autodesk.Revit.DB.Material.Smoothness Property

**中文**: 材质、材料

The smoothness of the material.

## Syntax (C#)
```csharp
public int Smoothness { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: values for shininess must be between 0 and 128